RIET/src/Documents/CustomsPaymentAllocation/CustomsPaymentAllocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsPaymentAllocation</name>
  <basedOn>Document.CustomsPayment</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <basedOn>Document.FutureCustomsPayments</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <registerRecords>AccumulationRegister.UnpaidCCDs</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>AccumulationRegister.UnpaidFutureCustomsPayments</registerRecords>
  <registerRecords>AccumulationRegister.UnallocatedCustomsPayments</registerRecords>
  <attributes>
    <name>CustomsPayment</name>
    <type>
      <types>DocumentRef.CustomsPayment</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentKind</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDocument</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/AccumulationRegisters/UnallocatedCustomsPayments/UnallocatedCustomsPayments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>UnallocatedCustomsPayments</name>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>CustomsPayment</name>
    <type>
      <types>DocumentRef.CustomsPayment</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/UnpaidCCDs/UnpaidCCDs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>UnpaidCCDs</name>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>CCD</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentKind</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/НеоплаченныеТПО/НеоплаченныеТПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НеоплаченныеТПО</name>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТПО</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentKind</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/CustomsDeposits/CustomsDeposits.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>CustomsDeposits</name>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Enums/TypesOfCustomsFileLightTransaction/TypesOfCustomsFileLightTransaction.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfCustomsFileLightTransaction</name>
  <enumValues>
    <name>CustomsFileLight</name>
  </enumValues>
  <enumValues>
    <name>ТПО</name>
  </enumValues>
  <enumValues>
    <name>CustomsBond</name>
  </enumValues>
  <enumValues>
    <name>CustomsBondClosing</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/CustomsPayment/CustomsPayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsPayment</name>
  <registerRecords>AccumulationRegister.UnallocatedCustomsPayments</registerRecords>
  <attributes>
    <name>TypeOfPayment</name>
    <type>
      <types>EnumRef.CustomsPaymentsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccountsForCustomsPayments</types>
    </type>
  </attributes>
  <attributes>
    <name>Customs</name>
    <type>
      <types>CatalogRef.Customs</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬCustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>CCDReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsCard</name>
    <type>
      <types>CatalogRef.CustomsCards</types>
    </type>
  </attributes>
  <attributes>
    <name>CheckNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentKind</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/Documents/CustomsFilesLight/CustomsFilesLight.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsFilesLight</name>
  <comment>Декларация на товары (легкая версия) / Таможенный приходный ордер</comment>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>AccumulationRegister.ItemsWithoutCVCDecision</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDepositsToRefund</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfCustomsFileLightTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>SeqNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportExport</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>Regime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>PSAContract</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleaseDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositAmountToRefund</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоГрафеВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaidByCCA</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositRefundTo</name>
    <type>
      <types>EnumRef.CustomsDepositsRefundTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ССD</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileHTC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileNetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <comment>RGS - Используется для TKG</comment>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceTotalValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>POLine</name>
      <type>
        <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>DescriptionForCustoms</name>
      <type>
        <types>EnumRef.DescriptionForCustoms</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceCorrectionValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>PaymentKind</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaidByCCA</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InTheSetoffCustomsDeposit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/CustomsPaymentAllocation/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ЗАПОЛНЕНИЯ

// ДОДЕЛАТЬ
Процедура ОбработкаЗаполнения(Основание)
	
	// ХОРОШО БЫ ЗАПОЛНИТЬ И PAYMENT KIND
	
	ТипЗнчОснования = ТипЗнч(Основание);
	Если ТипЗнчОснования = Тип("ДокументСсылка.CustomsPayment") Тогда
		
		CustomsPayment = Основание;
		
	ИначеЕсли ТипЗнчОснования = Тип("ДокументСсылка.ГТД")
		ИЛИ ТипЗнчОснования = Тип("ДокументСсылка.CustomsFilesLight") Тогда
		
		CustomsDocument = Основание;
		
	ИначеЕсли ТипЗнчОснования = Тип("Структура") Тогда
		
		// СДЕЛАТЬ СТАНДАРТНУЮ ПРОЦЕДУРУ
		Реквизиты = Метаданные().Реквизиты;
		Для Каждого КлючИЗначение Из Основание Цикл
			
			Реквизит = Реквизиты.Найти(КлючИЗначение.Ключ);
			Если Реквизит <> Неопределено И Реквизит.ЗаполнятьИзДанныхЗаполнения Тогда
				ЭтотОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(CustomsPayment)
		И НЕ ЗначениеЗаполнено(PaymentKind) Тогда
		PaymentKind = ОбщегоНазначения.ПолучитьЗначениеРеквизита(CustomsPayment, "PaymentKind");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(CustomsPayment)
		И ЗначениеЗаполнено(CustomsDocument) Тогда
		
		СтруктураПодбораCustomsPayments = CustomsСервер.ПолучитьСтруктуруПодбораCustomsPaymentsForAllocation(CustomsDocument, PaymentKind);
		ПодходящиеCustomsPayments = СтруктураПодбораCustomsPayments.CustomsPayments;
		Если ПодходящиеCustomsPayments.Количество() = 1 Тогда
			CustomsPayment = ПодходящиеCustomsPayments[0];
			PaymentKind = СтруктураПодбораCustomsPayments.PaymentKind;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(CustomsDocument)
		И ЗначениеЗаполнено(CustomsPayment) Тогда
		
		ПодходящиеCCDs = CustomsСервер.ПолучитьСтруктуруПодбораCCDsForAllocation(CustomsPayment).CCDs;
		Если ПодходящиеCCDs.Количество() = 1 Тогда
			CustomsDocument = ПодходящиеCCDs[0];
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(CustomsDocument)
		И ЗначениеЗаполнено(CustomsPayment) Тогда
		
		ПодходящиеТПО = CustomsСервер.ПолучитьСтруктуруПодбораТПОForAllocation(CustomsPayment).ТПО;
		Если ПодходящиеТПО.Количество() = 1 Тогда
			CustomsDocument = ПодходящиеТПО[0];
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизиты();	
	
	ПоместитьДополнительныеДанныеВДополнительныеСвойстваПередЗаписью(РежимЗаписи);
	
	ПроверитьЗаполнениеРеквизитов(Отказ, РежимЗаписи);
		
КонецПроцедуры

Процедура ДозаполнитьРеквизиты()
	
	ОбщегоНазначения.УстановитьЗначение(PaymentKind, СокрЛП(PaymentKind));
	ОбщегоНазначения.УстановитьЗначение(Comment, СокрЛП(Comment));
	
	Если НЕ ЗначениеЗаполнено(CreationDate) Тогда
		CreationDate = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(LastModified) Тогда
		LastModified = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Responsible) Тогда
		Responsible = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоместитьДополнительныеДанныеВДополнительныеСвойстваПередЗаписью(РежимЗаписи)
	
	СтруктураТекстов = Новый Структура;
	СтруктураПараметров = Новый Структура;
					
	// Запросы проверок заполнения
	Если НЕ ПометкаУдаления Тогда
				
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Если ЗначениеЗаполнено(CustomsPayment) Тогда
				
				СтруктураПараметров.Вставить("CustomsPayment", CustomsPayment);
				СтруктураТекстов.Вставить("РеквизитыCustomsPayment", 
					"ВЫБРАТЬ
					|	CustomsPayment.Customs,
					|	CustomsPayment.BankAccount.SoldTo КАК ParentCompany,
					|	CustomsPayment.PaymentKind
					|ИЗ
					|	Документ.CustomsPayment КАК CustomsPayment
					|ГДЕ
					|	CustomsPayment.Ссылка = &CustomsPayment");
											
			КонецЕсли;
			
			Если ЗначениеЗаполнено(CustomsDocument) Тогда
				
				СтруктураПараметров.Вставить("CustomsDocument", CustomsDocument);
				
				ТипЗнчCustomsDocument = ТипЗнч(CustomsDocument);
				Если ТипЗнчCustomsDocument = Тип("ДокументСсылка.ГТД") Тогда
					
					ТекстЗапросаРеквизитовCustomsDocument =
						"ВЫБРАТЬ
						|	ГТД.CustomsPost.Customs КАК Customs,
						|	ГТД.SoldTo.ParentCompanyForPayments КАК ParentCompanyForPayments
						|ИЗ
						|	Документ.ГТД КАК ГТД
						|ГДЕ
						|	ГТД.Ссылка = &CustomsDocument";
						
				ИначеЕсли ТипЗнчCustomsDocument = Тип("ДокументСсылка.CustomsFilesLight") Тогда
					
					ТекстЗапросаРеквизитовCustomsDocument =
						"ВЫБРАТЬ
						|	CustomsFilesLight.CustomsPost.Customs КАК Customs,
						|	CustomsFilesLight.SoldTo.ParentCompanyForPayments КАК ParentCompanyForPayments,
						|	CustomsFilesLight.TypeOfTransaction
						|ИЗ
						|	Документ.CustomsFilesLight КАК CustomsFilesLight
						|ГДЕ
						|	CustomsFilesLight.Ссылка = &CustomsDocument";
					
				КонецЕсли;
				
				СтруктураТекстов.Вставить("РеквизитыCustomsDocument", ТекстЗапросаРеквизитовCustomsDocument);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СтруктураРезультатов = РГСофт.ПолучитьСтруктуруРезультатовТекстовЗапросов(СтруктураТекстов, СтруктураПараметров);
	
	ДополнительныеСвойства.Вставить("ВыборкаРеквизитовCustomsPayment", Неопределено);
	Если СтруктураРезультатов.Свойство("РеквизитыCustomsPayment") Тогда
		ДополнительныеСвойства.ВыборкаРеквизитовCustomsPayment = СтруктураРезультатов.РеквизитыCustomsPayment.Выбрать();
		ДополнительныеСвойства.ВыборкаРеквизитовCustomsPayment.Следующий();
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ВыборкаРеквизитовCustomsDocument", Неопределено);
	Если СтруктураРезультатов.Свойство("РеквизитыCustomsDocument") Тогда
		ДополнительныеСвойства.ВыборкаРеквизитовCustomsDocument = СтруктураРезультатов.РеквизитыCustomsDocument.Выбрать();
		ДополнительныеСвойства.ВыборкаРеквизитовCustomsDocument.Следующий();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитов(Отказ, РежимЗаписи)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли; 
		
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Date"" не заполнено!",
			ЭтотОбъект, "Дата", , Отказ);
	КонецЕсли;
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли; 
				
    Если НЕ ЗначениеЗаполнено(CustomsPayment) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Customs payment"" не заполнено!",
			ЭтотОбъект, "CustomsPayment", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(CustomsDocument) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Customs document"" не заполнено!",
			ЭтотОбъект, "CustomsDocument", , Отказ);
	КонецЕсли;            
	
	Если НЕ ЗначениеЗаполнено(PaymentKind) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Payment kind"" не заполнено!",
			ЭтотОбъект, "PaymentKind", , Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(CustomsPayment)
		И ЗначениеЗаполнено(CustomsDocument) Тогда
		
		ВыборкаРеквизитовCustomsPayment = ДополнительныеСвойства.ВыборкаРеквизитовCustomsPayment;
		ВыборкаРеквизитовCustomsDocument = ДополнительныеСвойства.ВыборкаРеквизитовCustomsDocument;

		Если ВыборкаРеквизитовCustomsPayment.Customs <> ВыборкаРеквизитовCustomsDocument.Customs Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Customs в Customs payment  (" + ВыборкаРеквизитовCustomsPayment.Customs + ") не соответствует customs в Сustoms document (" + ВыборкаРеквизитовCustomsDocument.Customs + ")!",
				ЭтотОбъект, , , Отказ);
		КонецЕсли; 
		
		Если ВыборкаРеквизитовCustomsPayment.ParentCompany <> ВыборкаРеквизитовCustomsDocument.ParentCompanyForPayments Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Parent co. """ + ВыборкаРеквизитовCustomsPayment.ParentCompany + """ of Customs payment differs from Parent co. for payments """ + ВыборкаРеквизитовCustomsDocument.ParentCompanyForPayments + """ of Customs file!",
				ЭтотОбъект, , , Отказ);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(PaymentKind) И ЗначениеЗаполнено(ВыборкаРеквизитовCustomsPayment.PaymentKind)
			И СокрЛП(ВыборкаРеквизитовCustomsPayment.PaymentKind) <> "9070"
			И PaymentKind <> ВыборкаРеквизитовCustomsPayment.PaymentKind Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Payment kind в Customs payment (" + ВыборкаРеквизитовCustomsPayment.PaymentKind + ") не соответствует Payment kind в документе (" + PaymentKind + ")!",
				ЭтотОбъект, "CusomsPayment", , Отказ);
		КонецЕсли;
	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Sum) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Sum"" не заполнено!",
			ЭтотОбъект, "Sum", , Отказ);
	КонецЕсли; 
		
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ПРОВЕДЕНИЯ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвижениеПоUnallocatedCustomsPayments = Движения.UnallocatedCustomsPayments;
	ДвижениеПоUnallocatedCustomsPayments.Очистить();
	Движение = ДвижениеПоUnallocatedCustomsPayments.ДобавитьРасход();
	Движение.Период	= Дата;
	Движение.CustomsPayment = CustomsPayment;
	Движение.Sum = Sum;
	ДвижениеПоUnallocatedCustomsPayments.Записать();
	
	СтруктураПараметров = Новый Структура;
	СтруктураТекстов = Новый Структура;
	
	СтруктураПараметров.Вставить("PaymentKind", PaymentKind);
	
	ТипЗнчCustomsDocument = ТипЗнч(CustomsDocument);
	Если ТипЗнчCustomsDocument = Тип("ДокументСсылка.ГТД") Тогда
		
		ДвиженияПоUnpaidCCDs = Движения.UnpaidCCDs;
		ДвиженияПоUnpaidCCDs.Очистить();	
		Движение = ДвиженияПоUnpaidCCDs.ДобавитьРасход();
		Движение.Период	= Дата;
		Движение.CCD = CustomsDocument;
		Движение.PaymentKind = PaymentKind;
		Движение.Sum = Sum;
		ДвиженияПоUnpaidCCDs.Записать();
		
		СтруктураПараметров.Вставить("CCD", CustomsDocument);
		ТекстЗапросаОтрицательныхОстатковCustomsDocument = 
			"ВЫБРАТЬ
			|	UnpaidCCDsОстатки.SumОстаток
			|ИЗ
			|	РегистрНакопления.UnpaidCCDs.Остатки(
			|			,
			|			CCD = &CCD
			|				И PaymentKind = &PaymentKind) КАК UnpaidCCDsОстатки
			|ГДЕ
			|	UnpaidCCDsОстатки.SumОстаток < 0";	
		
	ИначеЕсли ТипЗнчCustomsDocument = Тип("ДокументСсылка.CustomsFilesLight") Тогда
		
		ДвиженияПоНеоплаченнымТПО = Движения.НеоплаченныеТПО;
		ДвиженияПоНеоплаченнымТПО.Очистить();	
		Движение = ДвиженияПоНеоплаченнымТПО.ДобавитьРасход();
		Движение.Период	= Дата;
		Движение.ТПО = CustomsDocument;
		Движение.PaymentKind = PaymentKind;
		Движение.Sum = Sum;
		ДвиженияПоНеоплаченнымТПО.Записать();
		
		СтруктураПараметров.Вставить("ТПО", CustomsDocument);
		ТекстЗапросаОтрицательныхОстатковCustomsDocument = 
			"ВЫБРАТЬ
			|	НеоплаченныеТПООстатки.SumОстаток
			|ИЗ
			|	РегистрНакопления.НеоплаченныеТПО.Остатки(
			|			,
			|			ТПО = &ТПО
			|				И PaymentKind = &PaymentKind) КАК НеоплаченныеТПООстатки
			|ГДЕ
			|	НеоплаченныеТПООстатки.SumОстаток < 0";
		
	КонецЕсли;
	
	СтруктураТекстов.Вставить("ОтрицательныеОстаткиCustomsDocument",
		ТекстЗапросаОтрицательныхОстатковCustomsDocument);
	
	СтруктураПараметров.Вставить("CustomsPayment", CustomsPayment);
	СтруктураТекстов.Вставить("ОтрицательныеОстаткиCustomsPayment",
		"ВЫБРАТЬ
		|	UnallocatedCustomsPaymentsОстатки.SumОстаток
		|ИЗ
		|	РегистрНакопления.UnallocatedCustomsPayments.Остатки(, CustomsPayment = &CustomsPayment) КАК UnallocatedCustomsPaymentsОстатки
		|ГДЕ
		|	UnallocatedCustomsPaymentsОстатки.SumОстаток < 0");
		
	СтруктураРезультатов = РГСофт.ПолучитьСтруктуруРезультатовТекстовЗапросов(СтруктураТекстов, СтруктураПараметров);
	
	Выборка = СтруктураРезультатов.ОтрицательныеОстаткиCustomsPayment.Выбрать();
	Если Выборка.Следующий() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"По """ + CustomsPayment + """ перерасход " + (-Выборка.SumОстаток) + "!",
			ЭтотОбъект, "Sum", , Отказ);
			
	КонецЕсли;
	
	Выборка = СтруктураРезультатов.ОтрицательныеОстаткиCustomsDocument.Выбрать();
	Если Выборка.Следующий() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"По """ + CustomsDocument + """ и Payment kind " + PaymentKind + " переплачено " + (-Выборка.SumОстаток) + "!",
			ЭтотОбъект, "Sum", , Отказ);
		
	КонецЕсли;
	
	ДвиженияПоCustomsDeposits(Отказ, ДополнительныеСвойства.ВыборкаРеквизитовCustomsDocument);
	
КонецПроцедуры

Процедура ДвиженияПоCustomsDeposits(Отказ, ВыборкаРеквизитовCustomsDocument)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.CustomsDeposits.Очистить();
	Движения.CustomsDeposits.Записывать = Истина;
	
	Если ТипЗнч(CustomsDocument) <> Тип("ДокументСсылка.CustomsFilesLight") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыборкаРеквизитовCustomsDocument.TypeOfTransaction <> Перечисления.TypesOfCustomsFileLightTransaction.CustomsBond Тогда
		Возврат;
	КонецЕсли;
		
	Движения.CustomsDeposits.ДобавитьЗапись(
		ВидДвиженияНакопления.Приход,
		Дата,
		CustomsDocument,
		Sum);
		     		
КонецПроцедуры
